; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	thermograph0 - mode
	infrared5 - mode
	thermograph4 - mode
	thermograph2 - mode
	image1 - mode
	image6 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	Star6 - direction
	GroundStation0 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image6)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon14 infrared5)
	(have_image Phenomenon15 thermograph4)
	(have_image Phenomenon15 thermograph3)
	(have_image Star16 thermograph3)
	(have_image Star16 thermograph0)
	(have_image Star17 image6)
	(have_image Star17 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon14 instrument0 infrared5)
   added: (have_image phenomenon14 infrared5)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon15 instrument0 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon15 instrument0 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 3 of 7
9. (turn_to satellite0 star16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star16)
   goals met: 3 of 7
10. (take_image satellite0 star16 instrument0 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 4 of 7
11. (take_image satellite0 star16 instrument0 thermograph3)
   added: (have_image star16 thermograph3)
   goals met: 5 of 7
12. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 5 of 7
13. (take_image satellite0 star17 instrument0 image6)
   added: (have_image star17 image6)
   goals met: 6 of 7
14. (take_image satellite0 star17 instrument0 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 7 of 7
